package cc.whyy0u;


import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

@SpringBootApplication
public class App {

    /*
     * Code By @WhyY0u
     */

    // Это цельи надо еще добавить доходы например доход каждые 3 месяца по столько-то или даже человек может ссам добавить доход
    // Допустим он нашол 1000 тг и сам может указать типа что просто нашол их и добавить 
    // А также надо добаить расходы расходы допустим каждые там месяц столько-то и проверять сколько ему хватает и не хватает и напомниние об оплате
    // также можно добавить сколько он потратил на еду на развличение и т.д сам но это уже по усмотрению пусть сами пишут
    // Лекции допустим будет лента где всякие советы по финансам и т.д
    // И если он много тартит и не знает где найти деньги надо показвать видео ролики о финансовой грамотности
    // Также надо каждый день присылать уведомление что надо отложить сколько-то денег и пусть он подтвержает что отложил

 
    public static void main(String[] args) {
        SpringApplication.run(App.class, args); 
    }
}

